In [2]:
import pandas as pd
import numpy as np

## 1 [join/merge two df in pandas](http://pandas.pydata.org/pandas-docs/stable/merging.html)

In [17]:
raw_data = {'subject_id': ['1', '2', '3', '4', '5'],'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])
df_a

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [10]:
raw_data = {'subject_id': ['4', '5', '6', '7', '8'],'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
df_b = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])
df_b

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [11]:
raw_data = {'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
            'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}
df_n = pd.DataFrame(raw_data, columns = ['subject_id','test_id'])
df_n

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

In [4]:
df_new = pd.concat([df_a, df_b])
df_new

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [5]:
pd.concat([df_a, df_b], axis=1)

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

In [6]:
pd.merge(df_new, df_n, on='subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

In [13]:
print (pd.merge(df_a, df_b, on='subject_id', how='right'))
print (pd.merge(df_a, df_b, on='subject_id', how='left'))
print (pd.merge(df_a, df_b, on='subject_id', how='inner'))
print (pd.merge(df_a, df_b, on='subject_id', how='outer'))

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black
2          6          NaN         NaN         Bran     Balwner
3          7          NaN         NaN        Bryce       Brice
4          8          NaN         NaN        Betty      Btisan
  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black
  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Btisan

## 2 [groupby](http://pandas.pydata.org/pandas-docs/stable/groupby.html)

In [3]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],'C' : np.random.randn(8), 'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.870593 -0.167464
1  bar    one  0.946597 -0.795046
2  foo    two -0.180297 -1.212252
3  bar  three -0.742490  1.419125
4  foo    two -0.992789  1.516834
5  bar    two -0.680487 -0.448618
6  foo    one -0.018364 -1.834750
7  foo  three  1.664320  0.141713

In [6]:
group1=df.groupby('A',as_index=False)#as_index=False is important here
print (group1.groups)
print (type(group1))

{'bar': Int64Index([1, 3, 5], dtype='int64'), 'foo': Int64Index([0, 2, 4, 6, 7], dtype='int64')}
<class 'pandas.core.groupby.DataFrameGroupBy'>

In [7]:
print (group1.get_group('foo'))
group1.sum()

     A      B         C         D
0  foo    one  0.870593 -0.167464
2  foo    two -0.180297 -1.212252
4  foo    two -0.992789  1.516834
6  foo    one -0.018364 -1.834750
7  foo  three  1.664320  0.141713

     A         C         D
0  bar -0.476381  0.175461
1  foo  1.343463 -1.555919

In [27]:
group2=df.groupby(['A','B'])
group2.sum()

                  C         D
A   B
bar one    1.161173  0.169821
    three  0.346246  1.544767
    two    0.611930  0.994094
foo one    2.033654 -0.135510
    three -0.056418  0.609799
    two   -2.544414  2.077538

In [30]:
print (group2.aggregate(np.mean))#注意aggregate()里面的function是真的aggregate的np series用的。。
group2.aggregate(lambda x: np.mean(x)+1 )

                  C         D
A   B
bar one    1.161173  0.169821
    three  0.346246  1.544767
    two    0.611930  0.994094
foo one    1.016827 -0.067755
    three -0.056418  0.609799
    two   -1.272207  1.038769

                  C         D
A   B
bar one    2.161173  1.169821
    three  1.346246  2.544767
    two    1.611930  1.994094
foo one    2.016827  0.932245
    three  0.943582  1.609799
    two   -0.272207  2.038769

In [33]:
group1['C','D'].agg([np.sum, np.mean, np.std])

            C                             D
          sum      mean       std       sum      mean       std
A
bar  2.119349  0.706450  0.415604  2.708682  0.902894  0.691995
foo -0.567178 -0.113436  1.265814  2.551828  0.510366  0.630781

## 3 pandas query and selection, append rows

In [2]:
from numpy.random import randn
from pandas import DataFrame
df = DataFrame(randn(10, 2), columns=list('ab'))
print (df.query('a > 0.2'))
print (df.query('a > b')) 
df[df.a > df.b] 
df[df['a']>0]

          a         b
2  1.777017  1.298066
3  1.992120 -0.778035
6  1.120998  0.955692
          a         b
2  1.777017  1.298066
3  1.992120 -0.778035
5 -0.311145 -0.384922
6  1.120998  0.955692

          a         b
2  1.777017  1.298066
3  1.992120 -0.778035
6  1.120998  0.955692

In [3]:
df[(df['a']>0) | (df['a']>0)] ## | is or的意思， &是and的意思。 记住一定要到小括号

          a         b
2  1.777017  1.298066
3  1.992120 -0.778035
6  1.120998  0.955692

### 3.1series is so great, it has keys so you can assign values to change.

In [1]:
import pandas as pd
a=[1,2,3,4,5,6]
b=pd.Series([1,2,3,4,5])
b.values
b[1]='yes'
print (b[4])
b

5

0      1
1    yes
2      3
3      4
4      5
dtype: object

### 3.2 add a row to df

In [10]:
from numpy.random import randn
a=[1,2]
df = pd.DataFrame(randn(3, 2), columns=list('ab'))
print (df)
df.loc[4]=a
df

          a         b
0  0.103211  0.810764
1  0.173370  0.574160
2 -0.701405 -0.329605

          a         b
0  0.103211  0.810764
1  0.173370  0.574160
2 -0.701405 -0.329605
4  1.000000  2.000000

### 4 create dataframe

In [3]:
my_dict = dict( A = np.array([1,2]), B = np.array([1,2,3,4]) )
print (my_dict)
df = pd.DataFrame.from_dict(my_dict, orient='index')
df

{'A': array([1, 2]), 'B': array([1, 2, 3, 4])}

   0  1    2    3
A  1  2  NaN  NaN
B  1  2  3.0  4.0

In [4]:
df.transpose()

     A    B
0  1.0  1.0
1  2.0  2.0
2  NaN  3.0
3  NaN  4.0

In [5]:
listforDf=[['name','age','height'],['yang',31,6.2],['qing',30,6.4]]
pd.DataFrame(listforDf[1:],columns=listforDf[0])

   name  age  height
0  yang   31     6.2
1  qing   30     6.4